规则版本：20201113141926

        变更的规则列表(bp_rule)：

        id:2663
        code:user_after_sale
        name:用户售后退自动审核规则.ql
        rulesetId:613
        script:
        ---------------
        if (applyAmount != null && applyAmount == 0 && refundType != 3) {
        return 'agree';
        }

/**
 * 特殊的业务场景码规则
 **/
        if(scenarioGroup != null && scenarioGroup == 'HEMA_YOUXUAN'){
        if(payTimeGapInHour < 72 && applyAmount <= 5000){
        return 'agree';
        }
        return 'unsettled';
        }

/**
 * 特殊的业务sbt规则
 **/
        sbt_need_audit_by_person = [21,22,23];
        is_sbt_need_audit_by_person = false;
        for(i = 0; i < sbt_need_audit_by_person.length; i++) {
        if(wdksbt == sbt_need_audit_by_person[i]) {
        is_sbt_need_audit_by_person = true;
        }
        }
        if(is_sbt_need_audit_by_person) {
        return 'unsettled';
        }


/**
 * 产地量贩退款单自动审核
 **/
        if (wdksbt == 16) {
        item_deteriorate_reason_ids = [120053,120056,120058,120059,120061,120065,120069,120071,120073,120074,120075,120078,120080,120081,120082,120083,120084,120086,120087,120088,120091,120092,120096,120097,120098,120099,120560,120562,120563,120565,120569,120573,120575,120577,120578,120579,120582,120584,120585,120586,120587,120588,120590,120591,120592,120595,120596,120600,120601,120602,120603,120979,120981,120982,120984,120988,120992,120994,120996,120997,120998,121001,121003,121004,121005,121006,121007,121009,121010,121011,121014,121015,121019,121020,121021,121022,121345,121347,121348,121350,121354,121358,121360,121362,121363,121364,121367,121369,121370,121371,121372,121373,121375,121376,121377,121380,121381,121385,121386,121387,121388,121807,121809,121810,121812,121816,121820,121822,121824,121825,121826,121829,121831,121832,121833,121834,121835,121837,121838,121839,121842,121843,121847,121848,121849,121850,122282,122284,122285,122287,122291,122295,122297,122299,122300,122301,122304,122306,122307,122308,122309,122310,122312,122313,122314,122317,122318,122322,122323,122324,122325,122688,122690,122691,122693,122697,122701,122703,122705,122706,122707,122710,122712,122713,122714,122715,122716,122718,122719,122720,122723,122724,122728,122729,122730,122731,122961,122963,122964,122966,122970,122974,122976,122978,122979,122980,122983,122985,122986,122987,122988,122989,122991,122992,122993,122996,122997,123001,123002,123003,123004,150117,150126,150133,150140,150148,150155,150162,150168,140049,140050,140051,140052,140053,140054,140055,140056];
        is_item_deteriorate = false;
        for (i = 0; i < item_deteriorate_reason_ids.length; i++) {
        if (reasonId == item_deteriorate_reason_ids[i]) {
        is_item_deteriorate = true;
        }
        }
        if (is_item_deteriorate && orderChannel == 2 && isGoodUser == 1 && payTimeGapInHour < 48 && applyAmount <= 1000) {
        return 'agree';
        }
        return 'unsettled';
        }


/**
 * 商家规则
 **/
        white_merchant_cods = ['HM'];
        is_in_white_merchant_cods = false;
        for(i = 0; i < white_merchant_cods.length; i++) {
        if(merchantCode == white_merchant_cods[i]) {
        is_in_white_merchant_cods = true;
        }
        }
        if(!is_in_white_merchant_cods) {
        return 'unsettled';
        }

/**
 * 发起原因-商品破损
 **/
        item_damaged_reason_ids = [120024];
        is_item_damaged = false;
        for (i=0;i<item_damaged_reason_ids.length;i++) {
        if (reasonId == item_damaged_reason_ids[i]) {
        is_item_damaged = true;
        }
        }
        if (is_item_damaged && orderChannel == 2 && isGoodUser == 1 && payTimeGapInHour < 24 && applyAmount <= 3000) {
        return 'agree';
        }

/**
 * 发起原因-商品腐烂发霉
 **/
        item_rot_reason_ids = [120053,120054,120055,120056,120057,120058,120059,120060,120061,120062,120063,120064,120065,120066,120067,120068,120069,120070,120071,120072,120073,120074,120075,120076,120077,120078,120079,120080,120081,120082,120083,120084,120085,120086,120087,120088,120089,120090,120091,120092,120093,120094,120095,120096,120097,120098,120099,121804,121805,121806,121807,121808,121809,121810,121811,121812,121813,121814,121815,121816,121817,121818,121819,121820,121821,121822,121823,121824,121825,121826,121827,121828,121829,121830,121831,121832,121833,121834,121835,121836,121837,121838,121839,121840,121841,121842,121843,121844,121845,121846,121847,121848,121849,121850,140001,140005,140009,140013,140017,140021,140025,140029,140033,140037,140041,140045,140049,140053,140057,140061,140065,140069,140073,140077,140081,140085,140089,140093,140097,140098,140105,140106,140113,140117,140121,140122,140129,140130,140137,140141,140145,140149,140153,140154,140161,140162,140169,140173];
        is_item_rot = false;
        for (i=0;i<item_rot_reason_ids.length;i++) {
        if (reasonId == item_rot_reason_ids[i]) {
        is_item_rot = true;
        }
        }
        if (is_item_rot && orderChannel == 2 && isGoodUser == 1 && payTimeGapInHour < 24 && applyAmount <= 3000) {
        return 'agree';
        }

/**
 * 发起原因-商品口味
 **/
        item_bad_taste_reason_ids = [120029,120030,120031,120032,120033,120034,120035,120036,120037,120038,120039,120040,120041,120042,120043,120044,120045,120046,120047,120048,120180,120181,120182,120183,120184,120185,120186,120187,120188,120189,120190,120191,120192,120193,121764,121765,121766,121767,121768,121769,121770,121771,121772,121773,121774,121775,121776,121777,121778,121779,121780,121781,121782,121783,121784,121785,121786,121787,121788,121789,121790,121791,121792,121793,121794,121795,121796,121797,121798,121799,121800,121801,121802,121803,121932,121933,121934,121935,121936,121937,121938,121939,121940,121941,121942,121943,121944,121945];
        is_item_bad_taste = false;
        for (i=0;i<item_bad_taste_reason_ids.length;i++) {
        if (reasonId == item_bad_taste_reason_ids[i]) {
        is_item_bad_taste = true;
        }
        }
        if (is_item_bad_taste && orderChannel == 2 && isGoodUser == 1 && payTimeGapInHour < 72 && applyAmount <= 3000) {
        return 'agree';
        }

/**
 * 发起原因-发错货物 or 漏发
 **/
        send_wrong_goods_reason_ids = [120022,120023];
        is_send_wrong_goods = false;
        for (i=0;i<send_wrong_goods_reason_ids.length;i++) {
        if (reasonId == send_wrong_goods_reason_ids[i]) {
        is_send_wrong_goods = true;
        }
        }
        if (is_send_wrong_goods && orderChannel == 2 && isGoodUser == 1 && payTimeGapInHour < 48 && applyAmount <= 2000) {
        return 'agree';
        }

        return 'unsettled';
        ---------------

        description:用户售后退自动审核规则
        extendInfo:
